[
    {
        "id": 0,
        "title": "Russia’s Shortfalls Create an Opportunity for Ukraine, Western Officials Say",
        "description": "TAIPEI, Aug 9 (Reuters) - Taiwan's foreign minister said on Tuesday that China was using the military drills it launched in protest against U.S. House Speaker Nancy Pelosi's visit as a game-plan to prepare for an invasion of the self-ruled island.Joseph Wu, speaking at a press conference in Taipei, offered no time-table for a possible invasion of Taiwan, which is claimed by China as its own.He said Taiwan would not be intimidated even as the drills continued with 'China often breaching the unofficial median line down the Taiwan Strait.China has used the drills in its military play-book to prepare for the invasion of Taiwan', Wu said 'It is conducting large-scale military exercises and missile launches, as well as cyberattacks, disinformation, and economic coercion, in an attempt to weaken public morale in Taiwan'.'After the drills conclude, China may try to routinise its action in an attempt to wreck the long-term status quo across the Taiwan Strait,' Wu said.",
        "brief": "TAIPEI, Aug 9 (Reuters) - Taiwan's forei..",
        "by": "Sarah Wu and Yimou Lee",
        "image": "/image/0.jpg",
        "source": "REUTERS",
        "added": "August 9, 2022",
        "read": "4 minute",
        "url": "https://www.reuters.com/world/asia-pacific/taiwanese-foreign-minister-warns-china-preparing-invasion-2022-08-09/"
    },
    {
        "id": 1,
        "title": "iOS 16 beta brings back the battery percentage icon",
        "description": "Earlier today, Apple released the fifth iOS 16 developer beta. It adds a handful of changes, but if you’ve spent any time on Twitter, you know there’s only one thing everyone wants to talk about: the return of the battery percentage indicator. For the first time since Apple removed the icon in 2017 to accommodate the iPhone X’s notch, it’s possible to see exactly how much battery your iPhone has left without pulling down the Control Center shade.If you’re enrolled in the developer beta, you can add the indicator to your status bar by opening the Settings menu and navigating to the Battery section. Once there, you’ll see a new toggle labeled “Battery Percentage.” The resulting icon is slightly larger than the one you’re probably used to seeing. Additionally, if you plug your iPhone into a charger, the icon will turn green and display a lightning symbol next to the battery percentage. Conversely, it's yellow when your iPhone is in low power mode.",
        "brief": "Earlier today, Apple released the fifth..",
        "by": "Igor Bonifacic",
        "image": "/image/1.webp",
        "source": "ENGADGET",
        "added": "August 8, 2022",
        "read": "2 minute",
        "url": "https://www.engadget.com/ios-16-beta-5-battery-percentage-icon-204040191.html"
    },
    {
        "id": 2,
        "title": "Earth broke the record for the shortest day since atomic clocks were invented",
        "description": "If you feel like there's less time in the day, you're correct.Scientists recorded the shortest day on Earth since the invention of the atomic clock.Our planet's rotation measured in at 1.59 milliseconds short of the normal 24-hour day on June 29, according to the International Earth Rotation and Reference Systems Service, an organization in charge of global timekeeping.A rotation is the length of time the Earth takes to spin once on its axis, which is roughly 86,400 seconds.The previous record was documented on July 19, 2020, when the day measured 1.47 milliseconds shorter than normal.The atomic clock is a standardized unit of measurement that has been used since the 1950s to tell time and measure the Earth's rotation, said Dennis McCarthy, retired director of time at the U.S. Naval Observatory.Despite June 29 breaking a record for the shortest day in modern history, there have been much shorter days on Earth, he said.When dinosaurs still roamed the planet 70 million years ago, a single day on Earth lasted about 23½ hours, according to a 2020 study published in Paleoceanography and Paleoclimatology.",
        "brief": "If you feel like there's less time in the..",
        "by": "Megan Marples",
        "image": "/image/2.jpg",
        "source": "CNN",
        "added": "August 8, 2022",
        "read": "12 minute",
        "url": "https://www.ksl.com/article/50454183/earth-broke-the-record-for-the-shortest-day-since-atomic-clocks-were-invented"
    },
    {
        "id": 3,
        "title": "NASA’s Curiosity Mars Rover Still Going 10 Years After Landing – What It’s Learned",
        "description": "NASA’s Curiosity Mars rover set out to answer a big question when it landed on the Red Planet 10 years ago: Could Mars have supported ancient life? Scientists have discovered the answer is yes and have been working to learn more about the planet’s past habitable environment. Credit: NASA/JPL-Caltech/ASU/MSSS/JHU-APLOver the past 10 years, Curiosity has driven nearly 18 miles (29 kilometers) and ascended 2,050 feet (625 meters) as it explores Gale Crater and the foothills of Mount Sharp within it. The Mars rover has analyzed 41 rock and soil samples, relying on a suite of science instruments to learn what they reveal about Earth’s rocky sibling. It’s success has pushed a team of engineers to devise ways to minimize wear and tear and keep the rover rolling. In fact, Curiosity’s mission was recently extended for another three years, allowing it to continue among NASA’s fleet of important astrobiological missions.",
        "brief": "NASA’s Curiosity Mars rover set out to..",
        "by": "JET PROPULSION LABORATORY",
        "image": "/image/3.jpg",
        "source": "NASA",
        "added": "August 7, 2022",
        "read": "8 minute",
        "url": "https://scitechdaily.com/nasas-curiosity-mars-rover-still-going-10-years-after-landing-what-its-learned/"
    },
    {
        "id": 4,
        "title": "European markets retreat slightly as focus turns to U.S. inflation, Fed outlook",
        "description": "The pan-European Stoxx 600 slipped 0.3% by mid-morning, with travel and leisure stocks shedding 1.2% to lead losses while insurance stocks gained 0.5%.Investors are trying to assess the potential pace of the U.S. Federal Reserve's monetary policy tightening efforts. A surprisingly strong U.S. jobs report last week seemed to reduce the likelihood of a recession, allowing the central bank the capacity for more aggressive rate hikes as it looks to rein in inflation.Wednesday's July consumer price index is expected to offer some clarity on the path of interest rate hikes.Shares in Asia-Pacific were mixed on Tuesday as markets continued to digest last week's stellar payrolls report and assess the trajectory of monetary policy, with Japan's Nikkei 225 the weakest performer in the region.U.S. stock futures rose slightly in early premarket trade on Tuesday as Wall Street reacted to some significant earnings report, in particular weaker-than-expected revenue from Nvidia and several chipmakers.",
        "brief": "The pan-European Stoxx 600 slipped 0.3%..",
        "by": "Elliot Smith",
        "image": "/image/4.avif",
        "source": "CNBC",
        "added": "August 5, 2022",
        "read": "13 minute",
        "url": "https://www.cnbc.com/2022/08/09/europe-markets-open-to-close-focus-turns-to-us-inflation-fed-outlook.html"
    },
    {
        "id": 5,
        "title": "Monkeypox Can Spread In Three Ways. Here’s What To Know And How To Avoid Infection.",
        "description": "Just two months after the virus landed in the US, monkeypox has been declared a national public health emergency — a déjà vu nightmare for the majority of Americans who are tired of being sick and living through unprecedented times.Even though experts don’t expect monkeypox to be the next COVID, the virus still isn’t something you want to mess with, particularly if you’re immunocompromised, pregnant, or have certain skin conditions, like eczema. But at least this time around, there are effective treatments and vaccines available for those exposed to the virus or at risk of serious disease.We spoke to several infectious disease experts to better understand how monkeypox spreads, what activities are riskiest at this time, and how to avoid infection as cases rise globally.“Risk is not black and white. There’s a lot of nuance around it in general, and that’s not just unique to monkeypox,” said Dr. Aniruddha Hazra, an infectious disease doctor with the University of Chicago specializing in LGBTQ health. “This is about figuring out what you feel comfortable doing while still enjoying your life and doing the things you want to do.” There are three ways you can catch monkeypox: direct skin-to-skin contact with an infected person; touching contaminated surfaces, objects, or fabrics; and contact with respiratory secretions like mucus.",
        "brief": "Just two months after the virus landed in..",
        "by": "Sarah Wu and Yimou Lee",
        "image": "/image/5.webp",
        "source": "REUTERS",
        "added": "August 9, 2022",
        "read": "4 minute",
        "url": "https://www.reuters.com/world/asia-pacific/taiwanese-foreign-minister-warns-china-preparing-invasion-2022-08-09/"
    },
    {
        "id": 6,
        "title": "Scientist admits 'space telescope' photo is actually chorizo in tasty Twitter prank",
        "description": "TAIPEI, Aug 9 (Reuters) - Taiwan's foreign minister said on Tuesday that China was using the military drills it launched in protest against U.S. House Speaker Nancy Pelosi's visit as a game-plan to prepare for an invasion of the self-ruled island.Joseph Wu, speaking at a press conference in Taipei, offered no time-table for a possible invasion of Taiwan, which is claimed by China as its own.He said Taiwan would not be intimidated even as the drills continued with 'China often breaching the unofficial median line down the Taiwan Strait.China has used the drills in its military play-book to prepare for the invasion of Taiwan', Wu said 'It is conducting large-scale military exercises and missile launches, as well as cyberattacks, disinformation, and economic coercion, in an attempt to weaken public morale in Taiwan'.'After the drills conclude, China may try to routinise its action in an attempt to wreck the long-term status quo across the Taiwan Strait,' Wu said.",
        "brief": "TAIPEI, Aug 9 (Reuters) - Taiwan's foreign..", 
        "by": "Katie Camero",
        "image": "/image/6.webp",
        "source": "SPACE",
        "added": "August 6, 2022",
        "read": "8 minute",
        "url": "https://www.space.com/james-webb-space-telescope-scientist-chorizo-prank"
    },
    {
        "id": 7,
        "title": "Researchers reveal how you could lose weight by doing one thing",
        "description": "Restricting your eating to between 7 am and 3 pm may help you lose weight and lower your blood pressure, international researchers have found.The randomized clinical trial of 90 obese adults in the United States found that people who only ate during the restricted period lost about 5 pounds more weight, compared to those who ate over 12 or more hours.They also lowered their blood pressure over a 14-week period.“The eTRE (early time-restricted eating) intervention may therefore be an effective treatment for both obesity and hypertension,” the authors said.",
        "brief": "Restricting your eating to between 7 am..",
        "by": "Angie Raphael",
        "image": "/image/7.webp",
        "source": "NEW YORK POST",
        "added": "August 8, 2022",
        "read": "13 minute",
        "url": "https://nypost.com/2022/08/08/researchers-reveal-how-you-could-lose-weight-by-doing-one-thing/"
    },
    {
        "id": 8,
        "title": "Biden says he’s ‘not worried’ about China’s increased aggression toward Taiwan following Pelosi’s visit",
        "description": "President Joe Biden said Monday he is “not worried” about China’s military exercises around Taiwan, adding that while he is “concerned that they’re moving as much as they are,” he does not think they’re going to continue to increase the pressure.The remarks came one day after Beijing concluded 72 hours of intense maneuvers and missile tests over and around Taiwan. The exercises involved dozens of Chinese fighter jets and warships to mimic a military blockade of the self-governing island that Beijing considers a province.Biden’s relative calm reflected the deliberate American strategy of not responding to Chinese bellicosity with equally hot saber-rattling.It also reflects a broader opinion within the Biden administration that Beijing does not intend to make good on its implicit threat to invade Taiwan, at least not in the near term.Given this assessment, the United States has adopted an approach, for now, of heightened vigilance, but steadfast refusal to be drawn into a military game of chicken in the Pacific.Last Thursday, the White House announced that Biden would keep a U.S. naval aircraft carrier strike group in the South China Sea longer than originally planned, in response to Beijing’s increased aggression toward Taiwan.At the same time, a Biden spokesman said the United States would postpone a previously scheduled intercontinental ballistic missile, or ICBM, test.The decisions signaled Washington’s desire to maintain American military alertness in the region, while also denying Beijing the opportunity to point to the long-planned U.S. missile test as evidence that America was responding to China’s own missile launches near Taiwan with military preparations of its own.",
        "brief": "President Joe Biden said Monday he is..",
        "by": "Christina Wilkie",
        "image": "/image/8.jpeg",
        "source": "CNBC",
        "added": "August 8, 2022",
        "read": "14 minute",
        "url": "https://www.cnbc.com/2022/08/08/biden-says-hes-not-worried-about-chinas-increased-aggression-toward-taiwan-following-pelosi-visit.html"
    },
    {
        "id": 9,
        "title": "Russia puts Iranian satellite into orbit",
        "description": "MOSCOW, Aug 9 (Reuters) - Russia launched an Iranian satellite into orbit on Tuesday from southern Kazakhstan, just three weeks after President Vladimir Putin and Supreme Leader Ayatollah Ali Khamenei pledged to work together against the West.The remote Khayyam sensing satellite, named after the 11th Century Persian poet and philosopher Omar Khayyam, was launched by a Russian Soyuz rocket from the Baikonur Cosmodrome in Kazakhstan and entered orbit successfully, Russia's space agency said.",
        "brief": "MOSCOW, Aug 9 (Reuters) - Russia launched..",
        "by": "Guy Faulconbridge",
        "image": "/image/9.jpg",
        "source": "REUTERS",
        "added": "August 6, 2022",
        "read": "4 minute",
        "url": "https://www.reuters.com/world/russia-launches-iranian-satellite-into-space-under-shadow-western-concerns-2022-08-09/"
    }
]